RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_rcc.h
#if !defined  (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE    12288000U /*!< Value of the I2S_CKIN external oscillator in Hz */
#endif /* EXTERNAL_CLOCK_VALUE */

#if !defined  (HSI48_VALUE)
#define HSI48_VALUE  48000000U  /*!< Value of the HSI48 oscillator in Hz */
#endif /* HSI48_VALUE */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_HSIDIV  HSI oscillator divider
  * @{
  */
#define LL_RCC_HSI_DIV_1                   0U
#define LL_RCC_HSI_DIV_2                   RCC_CR_HSIDIV_0
#define LL_RCC_HSI_DIV_4                   RCC_CR_HSIDIV_1
#define LL_RCC_HSI_DIV_8                   RCC_CR_HSIDIV
/**
  * @}
  */

/** @defgroup LL_RCC_EC_XSPI1SWP  XSXPI1 kernel clock switch position
  * @{
  */
#define LL_RCC_SWP_XSPI1_NEUTRAL           0U
#define LL_RCC_SWP_XSPI1_HCLK5             RCC_CKPROTR_XSPI1SWP_0
#define LL_RCC_SWP_XSPI1_PLL2S             RCC_CKPROTR_XSPI1SWP_1
#define LL_RCC_SWP_XSPI1_PLL2T             (RCC_CKPROTR_XSPI1SWP_1 | RCC_CKPROTR_XSPI1SWP_0)
#define LL_RCC_SWP_XSPI1_HCLK_DIV4         RCC_CKPROTR_XSPI1SWP_2
/**
  * @}
  */

/** @defgroup LL_RCC_EC_XSPI2SWP  SXPI2 kernel clock switch position
  * @{
  */
#define LL_RCC_SWP_XSPI2_NEUTRAL           0U
#define LL_RCC_SWP_XSPI2_HCLK5             RCC_CKPROTR_XSPI2SWP_0
#define LL_RCC_SWP_XSPI2_PLL2S             RCC_CKPROTR_XSPI2SWP_1
#define LL_RCC_SWP_XSPI2_PLL2T             (RCC_CKPROTR_XSPI2SWP_1 | RCC_CKPROTR_XSPI2SWP_0)
#define LL_RCC_SWP_XSPI2_HCLK_DIV4         RCC_CKPROTR_XSPI2SWP_2
/**
  * @}
  */

/** @defgroup RCC_LL_EC_FMCSWP  FMC kernel clock switch position
  * @{
  */
#define LL_RCC_SWP_FMC_NEUTRAL             0U
#define LL_RCC_SWP_FMC_HCLK5               RCC_CKPROTR_FMCSWP_0
#define LL_RCC_SWP_FMC_PLL1Q               RCC_CKPROTR_FMCSWP_1
#define LL_RCC_SWP_FMC_PLL2R               (RCC_CKPROTR_FMCSWP_1 | RCC_CKPROTR_FMCSWP_0)
#define LL_RCC_SWP_FMC_HSI                 RCC_CKPROTR_FMCSWP_2
#define LL_RCC_SWP_FMC_HCLK_DIV4           (RCC_CKPROTR_FMCSWP_2 | RCC_CKPROTR_FMCSWP_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSEDRIVE  LSE oscillator drive capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW                0U
#define LL_RCC_LSEDRIVE_MEDIUMLOW          RCC_BDCR_LSEDRV_0
#define LL_RCC_LSEDRIVE_MEDIUMHIGH         RCC_BDCR_LSEDRV_1
#define LL_RCC_LSEDRIVE_HIGH               RCC_BDCR_LSEDRV
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYS_CLKSOURCE  System clock switch
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_HSI           0U
#define LL_RCC_SYS_CLKSOURCE_CSI           RCC_CFGR_SW_0
#define LL_RCC_SYS_CLKSOURCE_HSE           RCC_CFGR_SW_1
#define LL_RCC_SYS_CLKSOURCE_PLL1          (RCC_CFGR_SW_1 | RCC_CFGR_SW_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYS_CLKSOURCE_STATUS  System clock switch status
  * @{
  */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSI    0U                                /*!< HSI used as system clock */
#define LL_RCC_SYS_CLKSOURCE_STATUS_CSI    RCC_CFGR_SWS_0                    /*!< CSI used as system clock */
#define LL_RCC_SYS_CLKSOURCE_STATUS_HSE    RCC_CFGR_SWS_1                    /*!< HSE used as system clock */
#define LL_RCC_SYS_CLKSOURCE_STATUS_PLL1   (RCC_CFGR_SWS_1 | RCC_CFGR_SWS_0) /*!< PLL1 used as system clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSWAKEUP_CLKSOURCE  System wakeup clock source
  * @{
  */
#define LL_RCC_SYSWAKEUP_CLKSOURCE_HSI     0U
#define LL_RCC_SYSWAKEUP_CLKSOURCE_CSI     RCC_CFGR_STOPWUCK
/**
  * @}
  */

/** @defgroup RCC_LL_EC_KERWAKEUP_CLKSOURCE  Kernel wakeup clock source
  * @{
  */
#define LL_RCC_KERWAKEUP_CLKSOURCE_HSI     0U
#define LL_RCC_KERWAKEUP_CLKSOURCE_CSI     RCC_CFGR_STOPKERWUCK
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_DIV  System prescaler
  * @{
  */
#define LL_RCC_SYSCLK_DIV_1                0U
#define LL_RCC_SYSCLK_DIV_2                RCC_CDCFGR_CPRE_3
#define LL_RCC_SYSCLK_DIV_4                (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_0)
#define LL_RCC_SYSCLK_DIV_8                (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_1)
#define LL_RCC_SYSCLK_DIV_16               (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_1 | RCC_CDCFGR_CPRE_0)
#define LL_RCC_SYSCLK_DIV_64               (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2)
#define LL_RCC_SYSCLK_DIV_128              (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2 | RCC_CDCFGR_CPRE_0)
#define LL_RCC_SYSCLK_DIV_256              (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2 | RCC_CDCFGR_CPRE_1)
#define LL_RCC_SYSCLK_DIV_512              RCC_CDCFGR_CPRE
/**
  * @}
  */

/** @defgroup RCC_LL_EC_AHB_DIV  AHB prescaler
  * @{
  */
#define LL_RCC_AHB_DIV_1                   0U
#define LL_RCC_AHB_DIV_2                   RCC_BMCFGR_BMPRE_3
#define LL_RCC_AHB_DIV_4                   (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_0)
#define LL_RCC_AHB_DIV_8                   (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_1)
#define LL_RCC_AHB_DIV_16                  (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_1 | RCC_BMCFGR_BMPRE_0)
#define LL_RCC_AHB_DIV_64                  (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2)
#define LL_RCC_AHB_DIV_128                 (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2 | RCC_BMCFGR_BMPRE_0)
#define LL_RCC_AHB_DIV_256                 (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2 | RCC_BMCFGR_BMPRE_1)
#define LL_RCC_AHB_DIV_512                 RCC_BMCFGR_BMPRE
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB1_DIV  APB1 prescaler
  * @{
  */
#define LL_RCC_APB1_DIV_1                  0U
#define LL_RCC_APB1_DIV_2                  RCC_APBCFGR_PPRE1_2
#define LL_RCC_APB1_DIV_4                  (RCC_APBCFGR_PPRE1_2 | RCC_APBCFGR_PPRE1_0)
#define LL_RCC_APB1_DIV_8                  (RCC_APBCFGR_PPRE1_2 | RCC_APBCFGR_PPRE1_1)
#define LL_RCC_APB1_DIV_16                 RCC_APBCFGR_PPRE1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB2_DIV  APB2 prescaler
  * @{
  */
#define LL_RCC_APB2_DIV_1                  0U
#define LL_RCC_APB2_DIV_2                  RCC_APBCFGR_PPRE2_2
#define LL_RCC_APB2_DIV_4                  (RCC_APBCFGR_PPRE2_2 | RCC_APBCFGR_PPRE2_0)
#define LL_RCC_APB2_DIV_8                  (RCC_APBCFGR_PPRE2_2 | RCC_APBCFGR_PPRE2_1)
#define LL_RCC_APB2_DIV_16                 RCC_APBCFGR_PPRE2
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB4_DIV  APB4 prescaler
  * @{
  */
#define LL_RCC_APB4_DIV_1                  0U
#define LL_RCC_APB4_DIV_2                  RCC_APBCFGR_PPRE4_2
#define LL_RCC_APB4_DIV_4                  (RCC_APBCFGR_PPRE4_2 | RCC_APBCFGR_PPRE4_0)
#define LL_RCC_APB4_DIV_8                  (RCC_APBCFGR_PPRE4_2 | RCC_APBCFGR_PPRE4_1)
#define LL_RCC_APB4_DIV_16                 RCC_APBCFGR_PPRE4
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB5_DIV  APB5 prescaler
  * @{
  */
#define LL_RCC_APB5_DIV_1                  0U
#define LL_RCC_APB5_DIV_2                  RCC_APBCFGR_PPRE5_2
#define LL_RCC_APB5_DIV_4                  (RCC_APBCFGR_PPRE5_2 | RCC_APBCFGR_PPRE5_0)
#define LL_RCC_APB5_DIV_8                  (RCC_APBCFGR_PPRE5_2 | RCC_APBCFGR_PPRE5_1)
#define LL_RCC_APB5_DIV_16                 RCC_APBCFGR_PPRE5
/**
  * @}
  */


/** @defgroup RCC_LL_EC_MCOxSOURCE  MCO source selection
  * @{
  */
#define LL_RCC_MCO1SOURCE_HSI              ((RCC_CFGR_MCO1SEL>>16U) | 0U)
#define LL_RCC_MCO1SOURCE_LSE              ((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_0)
#define LL_RCC_MCO1SOURCE_HSE              ((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_1)
#define LL_RCC_MCO1SOURCE_PLL1Q            ((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_0)
#define LL_RCC_MCO1SOURCE_HSI48            ((RCC_CFGR_MCO1SEL>>16U) | RCC_CFGR_MCO1SEL_2)
#define LL_RCC_MCO2SOURCE_SYSCLK           ((RCC_CFGR_MCO2SEL>>16U) | 0U)
#define LL_RCC_MCO2SOURCE_PLL2P            ((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_0)
#define LL_RCC_MCO2SOURCE_HSE              ((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_1)
#define LL_RCC_MCO2SOURCE_PLL1P            ((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_0)
#define LL_RCC_MCO2SOURCE_CSI              ((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2)
#define LL_RCC_MCO2SOURCE_LSI              ((RCC_CFGR_MCO2SEL>>16U) | RCC_CFGR_MCO2SEL_2 | RCC_CFGR_MCO2SEL_0)
/**
  * @}
  */

