RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_rcc.h
/** @defgroup RCC_LL_EC_ADC_CLKSOURCE  Peripheral ADC clock source selection
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE_PLL2P          0U
#define LL_RCC_ADC_CLKSOURCE_PLL3R          RCC_CCIPR1_ADCSEL_0
#define LL_RCC_ADC_CLKSOURCE_CLKP           RCC_CCIPR1_ADCSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ADFx_CLKSOURCE  Peripheral ADF clock source selection
  * @{
  */
#define LL_RCC_ADF1_CLKSOURCE_HCLK          0U
#define LL_RCC_ADF1_CLKSOURCE_PLL2P         RCC_CCIPR1_ADF1SEL_0
#define LL_RCC_ADF1_CLKSOURCE_PLL3P         RCC_CCIPR1_ADF1SEL_1
#define LL_RCC_ADF1_CLKSOURCE_I2S_CKIN      (RCC_CCIPR1_ADF1SEL_1 |  RCC_CCIPR1_ADF1SEL_0)
#define LL_RCC_ADF1_CLKSOURCE_CSI           RCC_CCIPR1_ADF1SEL_2
#define LL_RCC_ADF1_CLKSOURCE_HSI           (RCC_CCIPR1_ADF1SEL_2 |  RCC_CCIPR1_ADF1SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_CEC_CLKSOURCE  Peripheral CEC clock source selection
  * @{
  */
#define LL_RCC_CEC_CLKSOURCE_LSE            0U
#define LL_RCC_CEC_CLKSOURCE_LSI            RCC_CCIPR2_CECSEL_0
#define LL_RCC_CEC_CLKSOURCE_CSI_DIV_122    RCC_CCIPR2_CECSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_CLKP_CLKSOURCE  Peripheral CLKP clock source selection
  * @{
  */
#define LL_RCC_CLKP_CLKSOURCE_HSI           0U
#define LL_RCC_CLKP_CLKSOURCE_CSI           RCC_CCIPR1_CKPERSEL_0
#define LL_RCC_CLKP_CLKSOURCE_HSE           RCC_CCIPR1_CKPERSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ETHxPHY_CLKSOURCE  Peripheral ETHPHY clock source selection
  * @{
  */
#define LL_RCC_ETH1PHY_CLKSOURCE_HSE        0U
#define LL_RCC_ETH1PHY_CLKSOURCE_PLL3S      RCC_CCIPR1_ETH1PHYCKSEL
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ETHxREF_CLKSOURCE  Peripheral ETHREF clock source selection
  * @{
  */
#define LL_RCC_ETH1REF_CLKSOURCE_RMII       0U
#define LL_RCC_ETH1REF_CLKSOURCE_HSE        RCC_CCIPR1_ETH1REFCKSEL_0
#define LL_RCC_ETH1REF_CLKSOURCE_FB         RCC_CCIPR1_ETH1REFCKSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_FDCAN_CLKSOURCE  Peripheral FDCAN clock source selection
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE_HSE          0U
#define LL_RCC_FDCAN_CLKSOURCE_PLL1Q        RCC_CCIPR2_FDCANSEL_0
#define LL_RCC_FDCAN_CLKSOURCE_PLL2Q        RCC_CCIPR2_FDCANSEL_1
/**
  * @}
  */

/** @defgroup RCC_LL_EC_FMC_CLKSOURCE  Peripheral FMC clock source selection
  * @{
  */
#define LL_RCC_FMC_CLKSOURCE_HCLK           0U
#define LL_RCC_FMC_CLKSOURCE_PLL1Q          RCC_CCIPR1_FMCSEL_0
#define LL_RCC_FMC_CLKSOURCE_PLL2R          RCC_CCIPR1_FMCSEL_1
#define LL_RCC_FMC_CLKSOURCE_HSI            (RCC_CCIPR1_FMCSEL_1 | RCC_CCIPR1_FMCSEL_0)
#define LL_RCC_FMC_CLKSOURCE_HCLK_DIV4      LL_RCC_SWP_FMC_HCLK_DIV4  /* Recovery: Read-only */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_I2Cx_CLKSOURCE  Peripheral I2C clock source selection
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE_PCLK1         LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C1_I3C1SEL,  RCC_CCIPR2_I2C1_I3C1SEL_Pos,  0U)
#define LL_RCC_I2C1_CLKSOURCE_PLL3R         LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C1_I3C1SEL,  RCC_CCIPR2_I2C1_I3C1SEL_Pos,  RCC_CCIPR2_I2C1_I3C1SEL_0)
#define LL_RCC_I2C1_CLKSOURCE_HSI           LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C1_I3C1SEL,  RCC_CCIPR2_I2C1_I3C1SEL_Pos,  RCC_CCIPR2_I2C1_I3C1SEL_1)
#define LL_RCC_I2C1_CLKSOURCE_CSI           LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C1_I3C1SEL,  RCC_CCIPR2_I2C1_I3C1SEL_Pos,  RCC_CCIPR2_I2C1_I3C1SEL_1 |\
                                                         RCC_CCIPR2_I2C1_I3C1SEL_0)

#define LL_RCC_I2C23_CLKSOURCE_PCLK1        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C23SEL,  RCC_CCIPR2_I2C23SEL_Pos,  0U)
#define LL_RCC_I2C23_CLKSOURCE_PLL3R        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C23SEL,  RCC_CCIPR2_I2C23SEL_Pos,  RCC_CCIPR2_I2C23SEL_0)
#define LL_RCC_I2C23_CLKSOURCE_HSI          LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C23SEL,  RCC_CCIPR2_I2C23SEL_Pos,  RCC_CCIPR2_I2C23SEL_1)
#define LL_RCC_I2C23_CLKSOURCE_CSI          LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C23SEL,  RCC_CCIPR2_I2C23SEL_Pos,  RCC_CCIPR2_I2C23SEL_1 |\
                                                         RCC_CCIPR2_I2C23SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_I3Cx_CLKSOURCE  Peripheral I3C clock source selection
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE_PCLK1         0U
#define LL_RCC_I3C1_CLKSOURCE_PLL3R         RCC_CCIPR2_I2C1_I3C1SEL_0
#define LL_RCC_I3C1_CLKSOURCE_HSI           RCC_CCIPR2_I2C1_I3C1SEL_1
#define LL_RCC_I3C1_CLKSOURCE_CSI           (RCC_CCIPR2_I2C1_I3C1SEL_1 | RCC_CCIPR2_I2C1_I3C1SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPTIMx_CLKSOURCE  Peripheral LPTIM clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_PCLK1       LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  0U)
#define LL_RCC_LPTIM1_CLKSOURCE_PLL2P       LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  RCC_CCIPR2_LPTIM1SEL_0)
#define LL_RCC_LPTIM1_CLKSOURCE_PLL3R       LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  RCC_CCIPR2_LPTIM1SEL_1)
#define LL_RCC_LPTIM1_CLKSOURCE_LSE         LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  RCC_CCIPR2_LPTIM1SEL_1 |\
                                                         RCC_CCIPR2_LPTIM1SEL_0)
#define LL_RCC_LPTIM1_CLKSOURCE_LSI         LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  RCC_CCIPR2_LPTIM1SEL_2)
#define LL_RCC_LPTIM1_CLKSOURCE_CLKP        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL,  RCC_CCIPR2_LPTIM1SEL_Pos,  RCC_CCIPR2_LPTIM1SEL_2 |\
                                                         RCC_CCIPR2_LPTIM1SEL_0)

#define LL_RCC_LPTIM23_CLKSOURCE_PCLK4      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   0U)
#define LL_RCC_LPTIM23_CLKSOURCE_PLL2P      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   RCC_CCIPR4_LPTIM23SEL_0)
#define LL_RCC_LPTIM23_CLKSOURCE_PLL3R      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   RCC_CCIPR4_LPTIM23SEL_1)
#define LL_RCC_LPTIM23_CLKSOURCE_LSE        LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   RCC_CCIPR4_LPTIM23SEL_1 |\
                                                         RCC_CCIPR4_LPTIM23SEL_0)
#define LL_RCC_LPTIM23_CLKSOURCE_LSI        LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   RCC_CCIPR4_LPTIM23SEL_2)
#define LL_RCC_LPTIM23_CLKSOURCE_CLKP       LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM23SEL,   RCC_CCIPR4_LPTIM23SEL_Pos,   RCC_CCIPR4_LPTIM23SEL_2 |\
                                                         RCC_CCIPR4_LPTIM23SEL_0)

#define LL_RCC_LPTIM45_CLKSOURCE_PCLK4      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, 0U)
#define LL_RCC_LPTIM45_CLKSOURCE_PLL2P      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, RCC_CCIPR4_LPTIM45SEL_0)
#define LL_RCC_LPTIM45_CLKSOURCE_PLL3R      LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, RCC_CCIPR4_LPTIM45SEL_1)
#define LL_RCC_LPTIM45_CLKSOURCE_LSE        LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, RCC_CCIPR4_LPTIM45SEL_1 |\
                                                         RCC_CCIPR4_LPTIM45SEL_0)
#define LL_RCC_LPTIM45_CLKSOURCE_LSI        LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, RCC_CCIPR4_LPTIM45SEL_2)
#define LL_RCC_LPTIM45_CLKSOURCE_CLKP       LL_CLKSOURCE(CCIPR4_OFFSET,  RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, RCC_CCIPR4_LPTIM45SEL_2 |\
                                                         RCC_CCIPR4_LPTIM45SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPUARTx_CLKSOURCE  Peripheral LPUART clock source selection
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK4      0U
#define LL_RCC_LPUART1_CLKSOURCE_PLL2Q      RCC_CCIPR4_LPUART1SEL_0
#define LL_RCC_LPUART1_CLKSOURCE_PLL3Q      RCC_CCIPR4_LPUART1SEL_1
#define LL_RCC_LPUART1_CLKSOURCE_HSI        (RCC_CCIPR4_LPUART1SEL_1 | RCC_CCIPR4_LPUART1SEL_0)
#define LL_RCC_LPUART1_CLKSOURCE_CSI        RCC_CCIPR4_LPUART1SEL_2
#define LL_RCC_LPUART1_CLKSOURCE_LSE        (RCC_CCIPR4_LPUART1SEL_2 | RCC_CCIPR4_LPUART1SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LTDC_CLKSOURCE  Peripheral LTDC clock source selection
  * @{
  */
#define LL_RCC_LTDC_CLKSOURCE_PLL3R         0U
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PSSI_CLKSOURCE  Peripheral PSSI clock source selection
  * @{
  */
#define LL_RCC_PSSI_CLKSOURCE_PLL3R         0U
#define LL_RCC_PSSI_CLKSOURCE_CLKP          RCC_CCIPR1_PSSISEL
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAIx_CLKSOURCE  Peripheral SAI clock source selection
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE_PLL1Q         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, 0U)
#define LL_RCC_SAI1_CLKSOURCE_PLL2P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, RCC_CCIPR3_SAI1SEL_0)
#define LL_RCC_SAI1_CLKSOURCE_PLL3P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, RCC_CCIPR3_SAI1SEL_1)
#define LL_RCC_SAI1_CLKSOURCE_I2S_CKIN      LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, RCC_CCIPR3_SAI1SEL_0 |\
                                                         RCC_CCIPR3_SAI1SEL_1)
#define LL_RCC_SAI1_CLKSOURCE_CLKP          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, RCC_CCIPR3_SAI1SEL_2)

#define LL_RCC_SAI2_CLKSOURCE_PLL1Q         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, 0U)
#define LL_RCC_SAI2_CLKSOURCE_PLL2P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, RCC_CCIPR3_SAI2SEL_0)
#define LL_RCC_SAI2_CLKSOURCE_PLL3P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, RCC_CCIPR3_SAI2SEL_1)
#define LL_RCC_SAI2_CLKSOURCE_I2S_CKIN      LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, RCC_CCIPR3_SAI2SEL_1 |\
                                                         RCC_CCIPR3_SAI2SEL_0)
#define LL_RCC_SAI2_CLKSOURCE_CLKP          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, RCC_CCIPR3_SAI2SEL_2)
#define LL_RCC_SAI2_CLKSOURCE_SPDIFRX       LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, RCC_CCIPR3_SAI1SEL_2 |\
                                                         RCC_CCIPR3_SAI2SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SDMMC_CLKSOURCE  Peripheral SDMMC clock source selection
  * @{
  */
#define LL_RCC_SDMMC_CLKSOURCE_PLL2S        0U
#define LL_RCC_SDMMC_CLKSOURCE_PLL2T        RCC_CCIPR1_SDMMC12SEL
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SPDIF_CLKSOURCE  Peripheral SPDIF clock source selection
  * @{
  */
#define LL_RCC_SPDIFRX_CLKSOURCE_PLL1Q      0U
#define LL_RCC_SPDIFRX_CLKSOURCE_PLL2R      RCC_CCIPR2_SPDIFRXSEL_0
#define LL_RCC_SPDIFRX_CLKSOURCE_PLL3R      RCC_CCIPR2_SPDIFRXSEL_1
#define LL_RCC_SPDIFRX_CLKSOURCE_HSI        (RCC_CCIPR2_SPDIFRXSEL_0 | RCC_CCIPR2_SPDIFRXSEL_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SPIx_CLKSOURCE  Peripheral SPI clock source selection
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE_PLL1Q         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, 0U)
#define LL_RCC_SPI1_CLKSOURCE_PLL2P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, RCC_CCIPR3_SPI1SEL_0)
#define LL_RCC_SPI1_CLKSOURCE_PLL3P         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, RCC_CCIPR3_SPI1SEL_1)
#define LL_RCC_SPI1_CLKSOURCE_I2S_CKIN      LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, RCC_CCIPR3_SPI1SEL_1 |\
                                                         RCC_CCIPR3_SPI1SEL_0)
#define LL_RCC_SPI1_CLKSOURCE_CLKP          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, RCC_CCIPR3_SPI1SEL_2)

#define LL_RCC_SPI23_CLKSOURCE_PLL1Q        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, 0U)
#define LL_RCC_SPI23_CLKSOURCE_PLL2P        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, RCC_CCIPR2_SPI23SEL_0)
#define LL_RCC_SPI23_CLKSOURCE_PLL3P        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, RCC_CCIPR2_SPI23SEL_1)
#define LL_RCC_SPI23_CLKSOURCE_I2S_CKIN     LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, RCC_CCIPR2_SPI23SEL_1 |\
                                                         RCC_CCIPR2_SPI23SEL_0)
#define LL_RCC_SPI23_CLKSOURCE_CLKP         LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, RCC_CCIPR2_SPI23SEL_2)

#define LL_RCC_SPI45_CLKSOURCE_PCLK2        LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, 0U)
#define LL_RCC_SPI45_CLKSOURCE_PLL2Q        LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, RCC_CCIPR3_SPI45SEL_0)
#define LL_RCC_SPI45_CLKSOURCE_PLL3Q        LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, RCC_CCIPR3_SPI45SEL_1)
#define LL_RCC_SPI45_CLKSOURCE_HSI          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, RCC_CCIPR3_SPI45SEL_1 |\
                                                         RCC_CCIPR3_SPI45SEL_0)
#define LL_RCC_SPI45_CLKSOURCE_CSI          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, RCC_CCIPR3_SPI45SEL_2)
#define LL_RCC_SPI45_CLKSOURCE_HSE          LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, RCC_CCIPR3_SPI45SEL_2 |\
                                                         RCC_CCIPR3_SPI45SEL_0)

#define LL_RCC_SPI6_CLKSOURCE_PCLK4         LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, 0U)
#define LL_RCC_SPI6_CLKSOURCE_PLL2Q         LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, RCC_CCIPR4_SPI6SEL_0)
#define LL_RCC_SPI6_CLKSOURCE_PLL3Q         LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, RCC_CCIPR4_SPI6SEL_1)
#define LL_RCC_SPI6_CLKSOURCE_HSI           LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, RCC_CCIPR4_SPI6SEL_1 |\
                                                         RCC_CCIPR4_SPI6SEL_0)
#define LL_RCC_SPI6_CLKSOURCE_CSI           LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, RCC_CCIPR4_SPI6SEL_2)
#define LL_RCC_SPI6_CLKSOURCE_HSE           LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, RCC_CCIPR4_SPI6SEL_2 |\
                                                         RCC_CCIPR4_SPI6SEL_0)
/**
  * @}
  */

