RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_rcc.h
/** @defgroup RCC_LL_EC_USARTx_CLKSOURCE  Peripheral USART clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK2       LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, 0U)
#define LL_RCC_USART1_CLKSOURCE_PLL2Q       LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, RCC_CCIPR3_USART1SEL_0)
#define LL_RCC_USART1_CLKSOURCE_PLL3Q       LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, RCC_CCIPR3_USART1SEL_1)
#define LL_RCC_USART1_CLKSOURCE_HSI         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, RCC_CCIPR3_USART1SEL_1 |\
                                                         RCC_CCIPR3_USART1SEL_0)
#define LL_RCC_USART1_CLKSOURCE_CSI         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, RCC_CCIPR3_USART1SEL_2)
#define LL_RCC_USART1_CLKSOURCE_LSE         LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, RCC_CCIPR3_USART1SEL_2 |\
                                                         RCC_CCIPR3_USART1SEL_0)

#define LL_RCC_USART234578_CLKSOURCE_PCLK1  LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, 0U)
#define LL_RCC_USART234578_CLKSOURCE_PLL2Q  LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, RCC_CCIPR2_UART234578SEL_0)
#define LL_RCC_USART234578_CLKSOURCE_PLL3Q  LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, RCC_CCIPR2_UART234578SEL_1)
#define LL_RCC_USART234578_CLKSOURCE_HSI    LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, RCC_CCIPR2_UART234578SEL_1 |\
                                                         RCC_CCIPR2_UART234578SEL_0)
#define LL_RCC_USART234578_CLKSOURCE_CSI    LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, RCC_CCIPR2_UART234578SEL_2)
#define LL_RCC_USART234578_CLKSOURCE_LSE    LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, RCC_CCIPR2_UART234578SEL_2 |\
                                                         RCC_CCIPR2_UART234578SEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_OTGFS_CLKSOURCE  Peripheral OTGFS kernel clock source selection
  * @{
  */
#define LL_RCC_OTGFS_CLKSOURCE_HSI48        0U
#define LL_RCC_OTGFS_CLKSOURCE_PLL3Q        RCC_CCIPR1_OTGFSSEL_0
#define LL_RCC_OTGFS_CLKSOURCE_HSE          RCC_CCIPR1_OTGFSSEL_1
#define LL_RCC_OTGFS_CLKSOURCE_CLK48        (RCC_CCIPR1_OTGFSSEL_1 | RCC_CCIPR1_OTGFSSEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBPHYC_CLKSOURCE  Peripheral USBPHYC kernel clock source selection
  * @{
  */
#define LL_RCC_USBPHYC_CLKSOURCE_HSE        0U
#define LL_RCC_USBPHYC_CLKSOURCE_HSE_DIV_2  RCC_CCIPR1_USBPHYCSEL_0
#define LL_RCC_USBPHYC_CLKSOURCE_PLL3Q      RCC_CCIPR1_USBPHYCSEL_1
#define LL_RCC_USBPHYC_CLKSOURCE_DISABLE    (RCC_CCIPR1_USBPHYCSEL_1 | RCC_CCIPR1_USBPHYCSEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBREF_CLKSOURCE  Peripheral USBREF clock source selection
  * @{
  */
#define LL_RCC_USBREF_CLKSOURCE_16M         (RCC_CCIPR1_USBREFCKSEL_1 | RCC_CCIPR1_USBREFCKSEL_0)
#define LL_RCC_USBREF_CLKSOURCE_19_2M       RCC_CCIPR1_USBREFCKSEL_3
#define LL_RCC_USBREF_CLKSOURCE_20M         (RCC_CCIPR1_USBREFCKSEL_3 | RCC_CCIPR1_USBREFCKSEL_0)
#define LL_RCC_USBREF_CLKSOURCE_24M         (RCC_CCIPR1_USBREFCKSEL_3 | RCC_CCIPR1_USBREFCKSEL_1)
#define LL_RCC_USBREF_CLKSOURCE_26M         (RCC_CCIPR1_USBREFCKSEL_3 |\
                                             RCC_CCIPR1_USBREFCKSEL_2 | RCC_CCIPR1_USBREFCKSEL_1)
#define LL_RCC_USBREF_CLKSOURCE_32M         (RCC_CCIPR1_USBREFCKSEL_3 |\
                                             RCC_CCIPR1_USBREFCKSEL_1 | RCC_CCIPR1_USBREFCKSEL_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_XSPI_CLKSOURCE  Peripheral XSPI clock source selection
  * @{
  */
#define LL_RCC_XSPI1_CLKSOURCE_HCLK         LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI1SEL, RCC_CCIPR1_XSPI1SEL_Pos, 0U)
#define LL_RCC_XSPI1_CLKSOURCE_PLL2S        LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI1SEL, RCC_CCIPR1_XSPI1SEL_Pos, RCC_CCIPR1_XSPI1SEL_0)
#define LL_RCC_XSPI1_CLKSOURCE_PLL2T        LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI1SEL, RCC_CCIPR1_XSPI1SEL_Pos, RCC_CCIPR1_XSPI1SEL_1)
#define LL_RCC_XSPI1_CLKSOURCE_HCLK_DIV4    LL_RCC_SWP_XSPI1_HCLK_DIV4 /* Recovery: Read-only */

#define LL_RCC_XSPI2_CLKSOURCE_HCLK         LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI2SEL, RCC_CCIPR1_XSPI2SEL_Pos, 0U)
#define LL_RCC_XSPI2_CLKSOURCE_PLL2S        LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI2SEL, RCC_CCIPR1_XSPI2SEL_Pos, RCC_CCIPR1_XSPI2SEL_0)
#define LL_RCC_XSPI2_CLKSOURCE_PLL2T        LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI2SEL, RCC_CCIPR1_XSPI2SEL_Pos, RCC_CCIPR1_XSPI2SEL_1)
#define LL_RCC_XSPI2_CLKSOURCE_HCLK_DIV4    LL_RCC_SWP_XSPI2_HCLK_DIV4 /* Recovery: Read-only */
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_ADC_CLKSOURCE
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE                RCC_CCIPR1_ADCSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_ADFx_CLKSOURCE
  * @{
  */
#define LL_RCC_ADF1_CLKSOURCE               RCC_CCIPR1_ADF1SEL
/**
  * @}
  */


/** @addtogroup RCC_LL_EC_CEC_CLKSOURCE
  * @{
  */
#define LL_RCC_CEC_CLKSOURCE                RCC_CCIPR2_CECSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_CLKP_CLKSOURCE
  * @{
  */
#define LL_RCC_CLKP_CLKSOURCE               RCC_CCIPR1_CKPERSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_ETHxPHY_CLKSOURCE
  * @{
  */
#define LL_RCC_ETH1PHY_CLKSOURCE            RCC_CCIPR1_ETH1PHYCKSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_ETHxREF_CLKSOURCE
  * @{
  */
#define LL_RCC_ETH1REF_CLKSOURCE            RCC_CCIPR1_ETH1REFCKSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_FDCAN_CLKSOURCE
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE              RCC_CCIPR2_FDCANSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_FMC_CLKSOURCE
  * @{
  */
#define LL_RCC_FMC_CLKSOURCE                RCC_CCIPR1_FMCSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_I2Cx_CLKSOURCE
  * @{
  */
#define LL_RCC_I2C1_CLKSOURCE               LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C1_I3C1SEL, RCC_CCIPR2_I2C1_I3C1SEL_Pos, 0U)
#define LL_RCC_I2C23_CLKSOURCE              LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_I2C23SEL, RCC_CCIPR2_I2C23SEL_Pos, 0U)
/**
  * @}
  */

