RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_rcc.h
/** @addtogroup RCC_LL_EC_I3Cx_CLKSOURCE
  * @{
  */
#define LL_RCC_I3C1_CLKSOURCE               RCC_CCIPR2_I2C1_I3C1SEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_LPTIMx_CLKSOURCE
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE             LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_LPTIM1SEL, RCC_CCIPR2_LPTIM1SEL_Pos, 0U)
#define LL_RCC_LPTIM23_CLKSOURCE            LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_LPTIM23SEL, RCC_CCIPR4_LPTIM23SEL_Pos, 0U)
#define LL_RCC_LPTIM45_CLKSOURCE            LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_LPTIM45SEL, RCC_CCIPR4_LPTIM45SEL_Pos, 0U)
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_LPUARTx_CLKSOURCE
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE            RCC_CCIPR4_LPUART1SEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_OTGFS_CLKSOURCE
  * @{
  */
#define LL_RCC_OTGFS_CLKSOURCE              RCC_CCIPR1_OTGFSSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_PSSI_CLKSOURCE
  * @{
  */
#define LL_RCC_PSSI_CLKSOURCE               RCC_CCIPR1_PSSISEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_SAIx_CLKSOURCE
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE               LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI1SEL, RCC_CCIPR3_SAI1SEL_Pos, 0U)
#define LL_RCC_SAI2_CLKSOURCE               LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SAI2SEL, RCC_CCIPR3_SAI2SEL_Pos, 0U)
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_SDMMC_CLKSOURCE
  * @{
  */
#define LL_RCC_SDMMC_CLKSOURCE              RCC_CCIPR1_SDMMC12SEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_SPDIFRX_CLKSOURCE
  * @{
  */
#define LL_RCC_SPDIFRX_CLKSOURCE            RCC_CCIPR2_SPDIFRXSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_SPIx_CLKSOURCE
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE               LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI1SEL, RCC_CCIPR3_SPI1SEL_Pos, 0U)
#define LL_RCC_SPI23_CLKSOURCE              LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_SPI23SEL, RCC_CCIPR2_SPI23SEL_Pos, 0U)
#define LL_RCC_SPI45_CLKSOURCE              LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_SPI45SEL, RCC_CCIPR3_SPI45SEL_Pos, 0U)
#define LL_RCC_SPI6_CLKSOURCE               LL_CLKSOURCE(CCIPR4_OFFSET, RCC_CCIPR4_SPI6SEL, RCC_CCIPR4_SPI6SEL_Pos, 0U)
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_USARTx_CLKSOURCE
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE             LL_CLKSOURCE(CCIPR3_OFFSET, RCC_CCIPR3_USART1SEL, RCC_CCIPR3_USART1SEL_Pos, 0U)
#define LL_RCC_USART234578_CLKSOURCE        LL_CLKSOURCE(CCIPR2_OFFSET, RCC_CCIPR2_UART234578SEL, RCC_CCIPR2_UART234578SEL_Pos, 0U)
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_USBPHYC_CLKSOURCE
  * @{
  */
#define LL_RCC_USBPHYC_CLKSOURCE            RCC_CCIPR1_USBPHYCSEL
/**
  * @}
  */

/** @addtogroup RCC_LL_EC_USBREF_CLKSOURCE
  * @{
  */
#define LL_RCC_USBREF_CLKSOURCE             RCC_CCIPR1_USBREFCKSEL
/**
  * @}
  */


/** @addtogroup RCC_LL_EC_XSPIx_CLKSOURCE
  * @{
  */
#define LL_RCC_XSPI1_CLKSOURCE              LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI1SEL, RCC_CCIPR1_XSPI1SEL_Pos, 0U)
#define LL_RCC_XSPI2_CLKSOURCE              LL_CLKSOURCE(CCIPR1_OFFSET, RCC_CCIPR1_XSPI2SEL, RCC_CCIPR1_XSPI2SEL_Pos, 0U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE          0U
#define LL_RCC_RTC_CLKSOURCE_LSE           RCC_BDCR_RTCSEL_0
#define LL_RCC_RTC_CLKSOURCE_LSI           RCC_BDCR_RTCSEL_1
#define LL_RCC_RTC_CLKSOURCE_HSE           (RCC_BDCR_RTCSEL_0 | RCC_BDCR_RTCSEL_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_TIM_CLKPRESCALER  Timers clocks prescalers selection
  * @{
  */
#define LL_RCC_TIM_PRESCALER_DISABLE         0U
#define LL_RCC_TIM_PRESCALER_ENABLE          RCC_CFGR_TIMPRE
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLSOURCE   All PLLs entry clock source
  * @{
  */
#define LL_RCC_PLLSOURCE_HSI               0U
#define LL_RCC_PLLSOURCE_CSI               RCC_PLLCKSELR_PLLSRC_0
#define LL_RCC_PLLSOURCE_HSE               RCC_PLLCKSELR_PLLSRC_1
#define LL_RCC_PLLSOURCE_NONE              (RCC_PLLCKSELR_PLLSRC_1 | RCC_PLLCKSELR_PLLSRC_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLINPUTRANGE   All PLLs input range
  * @{
  */
#define LL_RCC_PLLINPUTRANGE_1_2           0U
#define LL_RCC_PLLINPUTRANGE_2_4           RCC_PLLCFGR_PLL1RGE_0
#define LL_RCC_PLLINPUTRANGE_4_8           RCC_PLLCFGR_PLL1RGE_1
#define LL_RCC_PLLINPUTRANGE_8_16          (RCC_PLLCFGR_PLL1RGE_1 | RCC_PLLCFGR_PLL1RGE_0)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLVCORANGE   All PLLs VCO range
  * @{
  */
#define LL_RCC_PLLVCORANGE_WIDE            0U                     /*!< VCO output range: 400 to 1600 MHz */
#define LL_RCC_PLLVCORANGE_MEDIUM          RCC_PLLCFGR_PLL1VCOSEL /*!< VCO output range: 150 to 420 MHz */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL_SPREAD_SEL  PLL Spread Spectrum Selection
  * @{
  */
#define LL_RCC_PLL_SPREAD_CENTER           0U                      /*!< PLL center spread spectrum selection */
#define LL_RCC_PLL_SPREAD_DOWN             RCC_PLL1SSCGR_SPREADSEL /*!< PLL down spread spectrum selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL_DITHERING_TPDFN  PLL Dithering TPDF Noise Control
  * @{
  */
#define LL_RCC_PLL_DITHERING_TPDFN_ENABLE  0U                      /*!< PLL Dithering TPDF Noise injection enabled */
#define LL_RCC_PLL_DITHERING_TPDFN_DISABLE RCC_PLL1SSCGR_TPDFNDIS  /*!< PLL Dithering TPDF Noise injection disabled */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL_DITHERING_RPDFN  PLL Dithering RPDF Noise Control
  * @{
  */
#define LL_RCC_PLL_DITHERING_RPDFN_ENABLE  0U                      /*!< PLL Dithering RPDF Noise injection enabled */
#define LL_RCC_PLL_DITHERING_RPDFN_DISABLE RCC_PLL1SSCGR_RPDFNDIS  /*!< PLL Dithering RPDF Noise injection disabled */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */

/** @defgroup RCC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCC register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_RCC_WriteReg(__REG__, __VALUE__) WRITE_REG(RCC->__REG__, (__VALUE__))

/**
  * @brief  Read a value in RCC register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_RCC_ReadReg(__REG__) READ_REG(RCC->__REG__)
/**
  * @}
  */

/** @defgroup RCC_LL_EM_CALC_FREQ Calculate frequencies
  * @{
  */

/**
  * @brief  Helper macro to calculate the SYSCLK frequency
  * @param  __SYSINPUTCLKFREQ__ Frequency of the input of sys_ck (based on HSE/CSI/HSI/PLL1P)
  * @param  __SYSPRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYSCLK_DIV_1
  *         @arg @ref LL_RCC_SYSCLK_DIV_2
  *         @arg @ref LL_RCC_SYSCLK_DIV_4
  *         @arg @ref LL_RCC_SYSCLK_DIV_8
  *         @arg @ref LL_RCC_SYSCLK_DIV_16
  *         @arg @ref LL_RCC_SYSCLK_DIV_64
  *         @arg @ref LL_RCC_SYSCLK_DIV_128
  *         @arg @ref LL_RCC_SYSCLK_DIV_256
  *         @arg @ref LL_RCC_SYSCLK_DIV_512
  * @retval SYSCLK clock frequency (in Hz)
  */
#define LL_RCC_CALC_SYSCLK_FREQ(__SYSINPUTCLKFREQ__, __SYSPRESCALER__) ((__SYSINPUTCLKFREQ__) >> ((LL_RCC_PrescTable[((__SYSPRESCALER__) &\
                                                                        RCC_CDCFGR_CPRE) >> RCC_CDCFGR_CPRE_Pos]) & 0x1FU))

/**
  * @brief  Helper macro to calculate the HCLK frequency
  * @param  __SYSCLKFREQ__ SYSCLK frequency.
  * @param  __HPRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_AHB_DIV_1
  *         @arg @ref LL_RCC_AHB_DIV_2
  *         @arg @ref LL_RCC_AHB_DIV_4
  *         @arg @ref LL_RCC_AHB_DIV_8
  *         @arg @ref LL_RCC_AHB_DIV_16
  *         @arg @ref LL_RCC_AHB_DIV_64
  *         @arg @ref LL_RCC_AHB_DIV_128
  *         @arg @ref LL_RCC_AHB_DIV_256
  *         @arg @ref LL_RCC_AHB_DIV_512
  * @retval HCLK clock frequency (in Hz)
  */
#define LL_RCC_CALC_HCLK_FREQ(__SYSCLKFREQ__, __HPRESCALER__) ((__SYSCLKFREQ__) >> ((LL_RCC_PrescTable[((__HPRESCALER__) &\
                                                               RCC_BMCFGR_BMPRE) >>  RCC_BMCFGR_BMPRE_Pos]) & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK1 frequency (ABP1)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB1PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK1_FREQ(__HCLKFREQ__, __APB1PRESCALER__) ((__HCLKFREQ__) >> ((LL_RCC_PrescTable[((__APB1PRESCALER__) &\
                                                                 RCC_APBCFGR_PPRE1) >>  RCC_APBCFGR_PPRE1_Pos]) & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK2 frequency (ABP2)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB2PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  * @retval PCLK2 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK2_FREQ(__HCLKFREQ__, __APB2PRESCALER__) ((__HCLKFREQ__) >> ((LL_RCC_PrescTable[((__APB2PRESCALER__) &\
                                                                 RCC_APBCFGR_PPRE2) >> RCC_APBCFGR_PPRE2_Pos]) & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK4 frequency (ABP4)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB4PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB4_DIV_1
  *         @arg @ref LL_RCC_APB4_DIV_2
  *         @arg @ref LL_RCC_APB4_DIV_4
  *         @arg @ref LL_RCC_APB4_DIV_8
  *         @arg @ref LL_RCC_APB4_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK4_FREQ(__HCLKFREQ__, __APB4PRESCALER__) ((__HCLKFREQ__) >> ((LL_RCC_PrescTable[((__APB4PRESCALER__) &\
                                                                 RCC_APBCFGR_PPRE4) >>  RCC_APBCFGR_PPRE4_Pos]) & 0x1FU))

/**
  * @brief  Helper macro to calculate the PCLK5 frequency (APB5)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB5PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB5_DIV_1
  *         @arg @ref LL_RCC_APB5_DIV_2
  *         @arg @ref LL_RCC_APB5_DIV_4
  *         @arg @ref LL_RCC_APB5_DIV_8
  *         @arg @ref LL_RCC_APB5_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define LL_RCC_CALC_PCLK5_FREQ(__HCLKFREQ__, __APB5PRESCALER__) ((__HCLKFREQ__) >> ((LL_RCC_PrescTable[((__APB5PRESCALER__) &\
                                                                 RCC_APBCFGR_PPRE5) >> RCC_APBCFGR_PPRE5_Pos]) & 0x1FU))

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO         0U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA         0xFFFFFFFFU        /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */

